knei-knurow/lidar-visualizations/stm32-discovery/Core/Src/main.cpp
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */




/*
//draw_background(mat, COLOR_BACKGROUND);

	BSP_LCD_Clear(0);
	draw_grid(mat, COLOR_GRID);

	while(1)
	{


		draw_point(mat, ORIGIN_X, ORIGIN_Y, color(255, 255, 255), 1.0);
		find_shape(cloud, 10000, 0);
		BSP_LCD_Clear(0);
		draw_grid(mat, COLOR_GRID);
		draw_cloud_shape(mat, cloud, 0, 0.6);
		draw_cloud_shape(mat, cloud, -3, 0.8);
		draw_cloud_shape(mat, cloud, -6, 1.0);
		//draw_cloud_shape(mat, cloud, 0, 1);
		draw_cloud_bars(mat, cloud);


			rotate_cloud(cloud, 4);
			//remove_cloud_shape(mat, cloud, 0);



			if(SINGLE_FRAME_MODE)
			{
			//	break;
			}

	}

	*/






/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "usb_host.h"
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_lcd.h"
#include "lidar.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string>
#include <iostream>
#include <fstream>
#include <algorithm>
#include <sstream>
#include <vector>
#include <cmath>
#include <utility>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define SINGLE_FRAME_MODE 1
#define STARTSCAN_RESPONSE_LENGTH 5 + 2
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

ETH_HandleTypeDef heth;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;

SD_HandleTypeDef hsd1;

SPDIFRX_HandleTypeDef hspdif;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_ETH_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SAI2_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

uint8_t response[LIDAR_BUFFER_SIZE] = {0};
uint8_t startscan[] = {0xA5, 0x20};
uint8_t reset[] = {0xA5, 0x40};
uint8_t stop_rq[] = {0xA5, 0x25};

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_DCMI_Init();
  MX_DMA2D_Init();
  MX_ETH_Init();
  MX_FMC_Init();
  MX_I2C1_Init();
  MX_I2C3_Init();
  //MX_LTDC_Init();
  MX_QUADSPI_Init();
  MX_RTC_Init();
  MX_SAI2_Init();
  MX_SDMMC1_SD_Init();
  MX_SPDIFRX_Init();
  MX_SPI2_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_TIM12_Init();
  MX_USART1_UART_Init();
  MX_USART6_UART_Init();
  MX_FATFS_Init();
  /* USER CODE BEGIN 2 */
  BSP_LCD_Init();
  BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);
  BSP_LCD_LayerDefaultInit(1, LCD_FB_START_ADDRESS + 1024 * 1024 * 4);
  BSP_LCD_DisplayOn();
  BSP_LCD_SelectLayer(0);


  //BSP_LCD_Clear(LCD_COLOR_GREEN);
  //BSP_LCD_FillRect(50, 50, 50, 50);
  //BSP_LCD_SetTransparency(0, 0xFF);

  	uint8_t* mat = (uint8_t* ) 0xC0000000;
  	uint8_t* mat2= (uint8_t* ) 0xC0000000 + 1024 * 1024 * 4;
	Cloud cloud;
	//load_cloud_fromString(fakefile, cloud, 0, 10000);


	__HAL_UART_CLEAR_IT(&huart6, UART_CLEAR_NEF|UART_CLEAR_OREF); //Clear trash in UART buffer
   HAL_UART_Transmit(&huart6, reset, 2, 2);


	//find_shape(cloud, 0);
	//draw_background(mat, COLOR_BACKGROUND);
	BSP_LCD_SelectLayer(0);
	BSP_LCD_Clear(0);
	BSP_LCD_SelectLayer(1);
	BSP_LCD_Clear(0);
	//draw_grid(mat, COLOR_GRID);
	//HAL_UART_Transmit(&huart6, startscan, 2, 1);

	HAL_Delay(1000);
	while(1)
	{


			for(uint16_t i = 0; i < LIDAR_BUFFER_SIZE; i++)
			{
					  response[i] = 0;
			 }


		  //HAL_UART_Transmit(&huart6, startscan, 2, 1);

		  HAL_UART_Transmit(&huart6, startscan, 2, 10);
		  __HAL_UART_CLEAR_IT(&huart6, UART_CLEAR_NEF|UART_CLEAR_OREF); //Clear trash in UART buffer
		  HAL_UART_Receive(&huart6, response, LIDAR_BUFFER_SIZE, 1000);
		  HAL_UART_Transmit(&huart6, stop_rq, 2, 10);
		 // HAL_UART_Transmit(&huart6, response, 30, 100);

		  	  //UWAGA!
		  cloud.pts.clear();
		  cloud.avg = 0;
		  cloud.max = 0;
		  cloud.min = 0;
		  cloud.size = 0;
		  cloud.std = 0;

		  for(int i = 0; i < LIDAR_BUFFER_SIZE - 21; i++)
		  {

