knei-knurow/lidar-visualizations/stm32-discovery/Core/Src/main.cpp
			  if(response[i] == 0xa5 && response[i+1] == 0x5a)
			  {
				  bool startFlagsCollected = false;
				  bool first = true;
				  float first_angle;
				  float previous_angle;
				  bool error = false;
				  for(int j = i + 2; j < LIDAR_BUFFER_SIZE - 10; j+=5)
				  {



					  /*j: quality, -S, S
					  j+1 ang 6:0
					  j+2 ang 14:7
					  j+3 dist 7:0
					  j+4 dist 15:8
					  */

					  	 /*
					  if((response[j] & (1<<0)) && !(response[j] & (1<<1)) && !startFlagsCollected)
					  {
						  startFlagsCollected = true;
					  }
					  else if((response[j] & (1<<0)) && !(response[j] & (1<<1)) && startFlagsCollected)
					  {
						  break;
					  }
					  */

					  //if(startFlagsCollected)
					  //{

					  	  uint16_t quality = response[j] >> 2;

						  uint16_t angle = ((uint16_t)response[j+1] >> 1) | (((uint16_t)response[j+2]) << 7);
						  float f_angle = ((float) angle) / 64.0f;

						 if(first)
						  {
							  first = false;

							  if(f_angle > 2.0) first_angle = f_angle;
							  else first_angle = 360.0;

						  }
						  else
						  {
							  if((f_angle > first_angle - 1.9) && (f_angle < first_angle)) break;
						  }



						  uint16_t distance = ((uint16_t) response[j+3]) | ((uint16_t)response[j+4] << 8);
						  float f_distance = ((float)distance) / 4.0f;


						 if(f_angle > 0.0 && f_distance > 1)
						  cloud_addPair(cloud, f_angle, f_distance, 0, 10000);


						 if((f_distance <= 0.0  && f_angle > 0.0 && f_angle < 361.0))
						 {
							 error = true;
						 }
					 // }

				  }
			  	  break;
			  }
		  }

		//find_shape(cloud, 10000, 0);


		//rotate_cloud(cloud, 4.0);

		BSP_LCD_SelectLayer(0);
		BSP_LCD_Clear(0);
		draw_grid(mat, COLOR_GRID);
		draw_point(mat, ORIGIN_X, ORIGIN_Y, color(255, 255, 255), 1.0);
		draw_connected_cloud(mat, cloud, 0, 0, 1.0, true);
		draw_cloud_bars(mat, cloud);


		//hltdc.LayerCfg[1].Alpha = 0;
		//hltdc.LayerCfg[0].Alpha = 255;



		/*
		BSP_LCD_SetLayerVisible(0, ENABLE);
		BSP_LCD_SetLayerVisible(1, DISABLE);
		//rotate_cloud(cloud, 4.0);
		BSP_LCD_SelectLayer(1);
		BSP_LCD_Clear(0);
		draw_grid(mat2, COLOR_GRID);
		draw_point(mat2, ORIGIN_X, ORIGIN_Y, color(255, 0, 0), 1.0);
		draw_connected_cloud(mat2, cloud, 0, 0, 1.0, true);
		draw_cloud_bars(mat2, cloud);
		//hltdc.LayerCfg[0].Alpha = 0;
		//hltdc.LayerCfg[1].Alpha = 255;
		BSP_LCD_SetLayerVisible(1, ENABLE);
		BSP_LCD_SetLayerVisible(0, DISABLE);
		//HAL_Delay(40);
		*/



	}


  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 4096);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();
  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 400;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_6) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SPDIFRX|RCC_PERIPHCLK_LTDC
                              |RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_USART1
                              |RCC_PERIPHCLK_USART6|RCC_PERIPHCLK_SAI2
                              |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_I2C3
                              |RCC_PERIPHCLK_SDMMC1|RCC_PERIPHCLK_CLK48;
  PeriphClkInitStruct.PLLI2S.PLLI2SN = 100;
  PeriphClkInitStruct.PLLI2S.PLLI2SP = RCC_PLLP_DIV2;
  PeriphClkInitStruct.PLLI2S.PLLI2SR = 2;
  PeriphClkInitStruct.PLLI2S.PLLI2SQ = 2;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
  PeriphClkInitStruct.PLLSAI.PLLSAIR = 5;
  PeriphClkInitStruct.PLLSAI.PLLSAIQ = 2;
  PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV8;
  PeriphClkInitStruct.PLLI2SDivQ = 1;
  PeriphClkInitStruct.PLLSAIDivQ = 1;
  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_8;
  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  PeriphClkInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLSAI;
  PeriphClkInitStruct.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInitStruct.Usart6ClockSelection = RCC_USART6CLKSOURCE_PCLK2;
  PeriphClkInitStruct.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
  PeriphClkInitStruct.I2c3ClockSelection = RCC_I2C3CLKSOURCE_PCLK1;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;
  PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_CLK48;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC3_Init(void)
{

  /* USER CODE BEGIN ADC3_Init 0 */

  /* USER CODE END ADC3_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC3_Init 1 */

